Show / Hide Table of Contents
Class MatSteelCISC
Material steel CISC
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatSteel
MatSteelCISC
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.Canadian.MatSteelCAN,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatSteel))]
public class MatSteelCISC : MatSteel
Properties
Improve this Doc   View Source
fu
Ultimate strength for nominal thickness of the element <= 40mm - fu
Declaration
public double fu { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
fy
Yield strength for nominal thickness of the element <= 40mm - fy
Declaration
public double fy { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source